In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("home_prices2.csv")
df

    area    city    price
0    200  mumbai  2000000
1    200    pune  1500000
2    200  nagpur  1000000
3    250  mumbai  2500000
4    250    pune  2000000
5    350  mumbai  3600000
6    400  mumbai  4200000
7    400  nagpur  2000000
8    450    pune  3500000
9    350    pune  2900000
10   600  nagpur  3000000
11   800  nagpur  4100000

In [3]:
from sklearn.preprocessing import LabelEncoder

In [4]:
le=LabelEncoder()
df.city=le.fit_transform(df.city)
df

    area  city    price
0    200     0  2000000
1    200     2  1500000
2    200     1  1000000
3    250     0  2500000
4    250     2  2000000
5    350     0  3600000
6    400     0  4200000
7    400     1  2000000
8    450     2  3500000
9    350     2  2900000
10   600     1  3000000
11   800     1  4100000

In [5]:
from sklearn.linear_model import LinearRegression

In [6]:
model=LinearRegression()
model.fit(df[["area","city"]],df.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [7]:
model.predict([[200,2]])

array([1671510.79136691])

In [8]:
model.score(df[["area","city"]],df.price)

0.5767062784025736

In [9]:
df=pd.read_csv("home_prices3.csv")
df.head()

   area    city
0   250  mumbai
1   300    pune
2   400  nagpur
3   310  mumbai
4   450    pune

In [10]:
le=LabelEncoder()

In [11]:
df["city_n"]=le.fit_transform(df["city"])
df.head()

   area    city  city_n
0   250  mumbai       0
1   300    pune       2
2   400  nagpur       1
3   310  mumbai       0
4   450    pune       2

In [12]:
df["price"]=model.predict(df[["area","city_n"]])
df.head()

   area    city  city_n         price
0   250  mumbai       0  2.525683e+06
1   300    pune       2  2.078187e+06
2   400  nagpur       1  2.810281e+06
3   310  mumbai       0  2.769689e+06
4   450    pune       2  2.688201e+06

In [13]:
df.drop("city_n",axis="columns",inplace=True)

In [15]:
df.head()

   area    city         price
0   250  mumbai  2.525683e+06
1   300    pune  2.078187e+06
2   400  nagpur  2.810281e+06
3   310  mumbai  2.769689e+06
4   450    pune  2.688201e+06

In [17]:
df.to_csv("home_prices3.csv",index=False)

In [ ]:
y=mx+b
y=m1x1+m2x2+m3x2+......mnxn+b